Repository: spqr2001/sles-reposerver
Catalog: source/locale/*/rmt.po
Languages: ru

source: %s is not yet activated on the system.
ru: Продукт %s еще не активирован в системе.

source: %{file} - File does not exist
ru: %{file} — файл не существует

source: %{file} - HTTP request failed with code %{code}
ru: %{file} — ошибка HTTP-запроса, код %{code}

source: %{file} - return code %{code}
ru: %{file} — код возврата %{code}

source: %{file} does not exist.
ru: Файл %{file} не существует.

source: %{path} is not a directory.
ru: %{path} не является каталогом.

source: %{path} is not writable by user %{username}.
ru: Каталог %{path} недоступен для записи пользователем %{username}.

source: A repository by the URL %{url} already exists.
ru: Репозиторий по ссылке URL %{url} уже существует.

source: Added association between %{repo} and product %{product}
ru: Добавлена связь между %{repo} и продуктом %{product}

source: Adding product %{product}
ru: Добавление продукта %{product}

source: All repositories have already been disabled.
ru: Все репозитории уже отключены.

source: All repositories have already been enabled.
ru: Все репозитории уже включены.

source: Arch
ru: Архив

source: Attach an existing custom repository to a product
ru: Прикрепить существующий настраиваемый репозиторий к продукту

source: Attached repository to product '%{product_name}'.
ru: Репозиторий прикреплен к продукту %{product_name}.

source: Authenticated system with login \"%{login}\"
ru: Выполнена аутентификация в системе с именем пользователя %{login}

source: Cannot connect to database server. Ensure its credentials are correctly configured in '%{path}' or configure RMT with YaST ('%{command}').
ru: Не удается подключиться к серверу баз данных. Проверьте правильность учетных данных в файле %{path} или настройте YaST для RMT (%{command}).

source: Cannot connect to database server. Make sure it is running and its credentials are configured in '%{path}'.
ru: Не удается подключиться к серверу баз данных. Убедитесь, что он запущен и учетные данные настроены в файле %{path}.

source: Cannot deactivate the product "%s". Other activated products depend upon it.
ru: Не удается деактивировать продукт %s. От него зависят другие активированные продукты.

source: Cannot find custom repository by ID %{id}.
ru: Не удается найти системный репозиторий с идентификатором %{id}.

source: Cannot find product by ID %{id}.
ru: Не удается найти продукт с идентификатором %{id}.

source: Check out %{url}
ru: Проверьте URL-адрес %{url}

source: Checksum doesn't match
ru: Не совпадает контрольная сумма

source: Cleaning up the database
ru: Очистка базы данных

source: Commands:
ru: Команды:

source: Could not create a temporary directory: %{error}
ru: Не удалось создать временный каталог: %{error}

source: Could not create deduplication hardlink: %{error}.
ru: Не удалось создать жесткую ссылку для дедупликации: %{error}.

source: Could not create local directory %{dir} with error: %{error}
ru: Не удалось создать локальный каталог %{dir}, ошибка: %{error}

source: Could not find system with login \"%{login}\" and password \"%{password}\"
ru: Не удалось найти систему с именем пользователя %{login} и паролем %{password}

source: Could not mirror suma product tree with error: %{error}
ru: Не удалось создать зеркальное отображение дерева продукта suma, ошибка: %{error}

source: Creates a custom repository.
ru: Создание пользовательского репозитория.

source: Detach an existing custom repository from a product
ru: Отсоединить существующий пользовательский репозиторий от продукта

source: Detached repository from product '%{product_name}'.
ru: Репозиторий отсоединен от продукта %{product_name}.

source: Disable mirroring of custom repository by ID
ru: Отключить зеркальное отображение пользовательского репозитория по идентификатору

source: Disable mirroring of product repositories by a list of product IDs or product strings.
ru: Отключить зеркальное отображение репозиториев продуктов по списку идентификаторов или строк продуктов.

source: Disable mirroring of repositories by a list of repository IDs
ru: Отключить зеркальное отображение репозиториев по списку их идентификаторов

source: Disabled repository %{repository}.
ru: Репозиторий %{repository} отключен.

source: Disabling %{product}:
ru: Отключение продукта %{product}:

source: Do not import the systems that were registered to the SMT
ru: Не импортировать системы, зарегистрированные в SMT

source: Do you have any suggestions for improvement? We would love to hear from you!
ru: Возможно, у вас есть пожелания или вы можете предложить улучшение? Мы будем рады об этом узнать!

source: Don't Mirror
ru: Не выполнять зеркальное отображение

source: Downloading data from SCC
ru: Выполняется загрузка данных из SCC

source: Enable debug output
ru: Разрешить вывод данных отладки

source: Enable mirroring of custom repository by ID
ru: Включить зеркальное отображение пользовательского репозитория по идентификатору

source: Enable mirroring of product repositories by a list of product IDs or product strings.
ru: Включить зеркальное отображение пользовательских репозиториев по списку идентификаторов или строк продуктов.

source: Enable mirroring of repositories by a list of repository IDs
ru: Включить зеркальное отображение репозиториев по списку их идентификаторов

source: Enabled mirroring for repository %{repo}
ru: Зеркальное отображение включено для репозитория %{repo}

source: Enabled repository %{repository}.
ru: Репозиторий %{repository} включен.

source: Enables all free modules for a product
ru: Включение всех бесплатных модулей для продукта

source: Enabling %{product}:
ru: Включение продукта %{product}:

source: Error while mirroring data: %{error}
ru: Ошибка при зеркальном отображении данных: %{error}

source: Error while mirroring license: %{error}
ru: Ошибка при зеркальном отображении лицезнии: %{error}

source: Error while mirroring metadata: %{error}
ru: Ошибка при зеркальном отображении метаданных: %{error}

source: Error while moving directory %{src} to %{dest}: %{error}
ru: Ошибка при переносе каталога из %{src} в %{dest}: %{error}

source: Export commands for Offline Sync
ru: Экспорт команд для автономной синхронизации

source: Exporting data from SCC to %{path}
ru: Выполняется экспорт данных из SCC в %{path}

source: Exporting orders
ru: Выполняется экспорт заказов

source: Exporting products
ru: Выполняется экспорт продуктов

source: Exporting repositories
ru: Выполняется экспорт репозиториев

source: Exporting subscriptions
ru: Выполняется экспорт подписок

source: Found product by target %{target}: %{products}.
ru: Найден продукт по целевому значению %{target}: %{products}.

source: Hardware information stored for system %{system}
ru: Для системы %{system} сохранена информация об оборудовании

source: ID
ru: ИД

source: Import commands for Offline Sync
ru: Импорт команд для автономной синхронизации

source: Imported activation of %{product} for %{system}
ru: Импортирована активация продукта %{product} для системы %{system}

source: Imported system %{system}
ru: Импортирована система %{system}

source: Importing SCC data from %{path}
ru: Выполняется импорт данных SCC из %{path}

source: Invalid system credentials
ru: Недействительные учетные данные для системы

source: Last Mirrored
ru: Последнее зеркальное отображение

source: Last mirrored
ru: Последнее зеркальное отображение

source: List all custom repositories
ru: Вывести список всех пользовательских репозиториев

source: List all products, including ones which are not marked to be mirrored
ru: Вывести список всех продуктов, включая те, что не помечены для зеркального отображения

source: List all repositories, including ones which are not marked to be mirrored
ru: Вывести список всех репозиториев, включая те, что не помечены для зеркального отображения

source: List and modify custom repositories
ru: Вывести список пользовательских репозиториев и изменить их

source: List and modify products
ru: Вывести список продуктов и изменить их

source: List and modify repositories
ru: Вывести список репозиториев и изменить их

source: List products which are marked to be mirrored.
ru: Вывести список продуктов, помеченных для зеркального отображения.

source: List repositories which are marked to be mirrored
ru: Вывести список репозиториев, помеченных для зеркального отображения

source: Mandatory
ru: Обязательно

source: Mandatory?
ru: Обязательно?

source: Mirror
ru: Зеркальное отображение

source: Mirror repos at given path
ru: Зеркально отобразить репозитории по указанному пути

source: Mirror repos from given path
ru: Зеркально отобразить репозитории из указанного пути

source: Mirror repositories
ru: Зеркально отобразить репозитории

source: Mirror?
ru: Выполнить зеркальное отображение?

source: Mirroring SUSE Manager product tree to %{dir}
ru: Выполняется зеркальное отображение дерева продуктов SUSE Manager в каталог %{dir}

source: Mirroring repository %{repo} to %{dir}
ru: Выполняется зеркальное отображение репозитория %{repo} в каталог %{dir}

source: Missing data files: %{files}
ru: Отсутствуют файлы данных: %{files}

source: Multiple base products found: '%s'.
ru: Найдено несколько базовых продуктов: %s.

source: Name
ru: Имя

source: No base product found.
ru: Базовый продукт не найден.

source: No custom repositories found.
ru: Пользовательские репозитории не найдены.

source: No matching products found in the database.
ru: В базе данных не найдено соответствующих продуктов.

source: No product IDs supplied
ru: Не указаны идентификаторы продуктов

source: No product found
ru: Продукт не найден

source: No product found for target %{target}.
ru: Не найден продукт для цели %{target}.

source: No product found on RMT for: %s
ru: В RMT не найден продукт для %s

source: No products attached to repository.
ru: К репозиторию не прикреплены продукты.

source: No repositories enabled.
ru: Нет включенных репозиториев.

source: No repositories found for product: %s
ru: Не найдены репозитории для продукта %s

source: No repository ids supplied
ru: Не указаны идентификаторы репозиториев

source: Not Mandatory
ru: Необязательно

source: Not all mandatory repositories are mirrored for product %s
ru: Зеркальное отображение выполнено не для всех обязательных репозиториев продукта %s

source: Not provided
ru: Не указано

source: Not yet activated Registration Code. Visit https://scc.suse.com to activate it.
ru: Код регистрации еще не активирован. Чтобы активировать его, зайдите на страницу https://scc.suse.com.

source: Only enabled products are shown by default. Use the '%{command}' option to see all products.
ru: По умолчанию отображаются только включенные продукты. Чтобы увидеть все продукты, воспользуйтесь параметром %{command}.

source: Only enabled repositories are shown by default. Use the '%{option}' option to see all repositories.
ru: По умолчанию отображаются только включенные репозитории. Чтобы увидеть все репозитории, воспользуйтесь параметром %{command}.

source: Output data in CSV format
ru: Вывести данные в формате CSV

source: Path to unpacked SMT data tarball
ru: Путь к tarball незапакованных данных SMT

source: Process is locked by the application with pid %{pid}. Close this application or wait for it to finish before trying again.
ru: Процесс заблокирован приложением с pid %{pid}. Закройте его или дождитесь завершения его работы, а затем повторите попытку.

source: Product
ru: Продукт

source: Product %{products} could not be found and was not disabled.
ru: Не удалось найти и отключить продукт %{products}.

source: Product %{products} could not be found and was not enabled.
ru: Не удалось найти и включить продукт %{products}.

source: Product %{product} not found
ru: Не удалось найти продукт %{product}

source: Product %{product} not found! Tried to attach custom repository %{repo} to product %{product}, but that product was not found. Attach it to a different product by running '%{command}'
ru: Не удалось найти продукт %{product}! Выполнена попытка подключить пользовательский репозиторий %{repo} к продукту %{product}, однако найти указанный продукт не удалось. Чтобы прикрепить репозиторий к другому продукту, воспользуйтесь командой %{command}.

source: Product Architecture
ru: Архитектура продукта

source: Product ID
ru: Идентификатор продукта

source: Product Name
ru: Название продукта

source: Product Version
ru: Версия продукта

source: Product by ID %{id} not found.
ru: Не удалось найти продукт с идентификатором %{id}.

source: RMT has not been synced to SCC yet. Please run '%{command}' before
ru: RMT еще не синхронизировано с SCC. Сначала выполните команду %{command}.

source: Read SCC data from given path
ru: Прочитать данные SCC по указанному пути

source: Remove a custom repository
ru: Удалить пользовательский репозиторий

source: Removed custom repository by ID %{id}.
ru: Пользовательский репозиторий с идентификатором %{id} удален.

source: Repository %{repos} could not be found and was not disabled.
ru: Не удалось найти и отключить репозиторий %{repos}.

source: Repository %{repos} could not be found and was not enabled.
ru: Не удалось найти и включить репозиторий %{repos}.

source: Repository %{repo} was not found in RMT database, perhaps you no longer have a valid subscription for it
ru: Не удалось найти репозиторий%{repo} в базе данных RMT. Возможно, для него отсутствует действующая подписка.

source: Repository by ID %{id} successfully disabled.
ru: Репозиторий с идентификатором %{id} успешно отключен.

source: Repository by ID %{id} successfully enabled.
ru: Репозиторий с идентификатором %{id} успешно включен.

source: Repository metadata signatures are missing
ru: Отсутствуют подписи метаданных репозитория

source: Repository not found by ID %{id}.
ru: Не удалось найти репозиторий с идентификатором %{id}.

source: Repository successfully disabled.
ru: Репозиторий успешно отключен.

source: Repository successfully enabled.
ru: Репозиторий успешно включен.

source: Requested service not found
ru: Запрошенная служба не найдена

source: Required parameters are missing or empty: %s
ru: Требуемые параметры отсутствуют или пустые: %s

source: Run '%{command}' for more information on a command and its subcommands.
ru: Чтобы получить дополнительные сведения о команде и ее вложенных командах, выполните команду %{command}.

source: Run '%{command}' to synchronize with your SUSE Customer Center data first.
ru: Сначала выполните команду %{command}, чтобы синхронизировать данные центра SUSE Customer Center.

source: SCC ID
ru: Идентификатор SCC

source: Settings saved at %{file}.
ru: Настройки сохранены в файле %{file}.

source: Show RMT version
ru: Показать версию RMT

source: Shows products attached to a custom repository
ru: Отображение продуктов, подключенных к пользовательскому репозиторию

source: Store SCC data in files at given path
ru: Сохранить данные SCC в файлах по указанному пути

source: Store repository settings at given path
ru: Сохранить настройки репозитория по указанному пути

source: Successfully added custom repository.
ru: Пользовательский репозиторий успешно добавлен.

source: Sync database with SUSE Customer Center
ru: Синхронизировать базу данных с центром SUSE Customer Center

source: System %{system} not found
ru: Система %{system} не найдена

source: The RMT database has not yet been initialized. Run '%{command}' to setup the database.
ru: База данных RMT еще не инициализирована. Чтобы настроить ее, выполните команду %{command}.

source: The SCC credentials are not configured correctly in '%{path}'. You can obtain them from %{url}
ru: Учетные данные SCC не настроены должным образом по пути %{path}. Их можно получить по URL-адресу %{url}.

source: The product "%s" is a base product and cannot be deactivated
ru: Продукт %s является базовым, и его нельзя деактивировать

source: The requested product '%s' is not activated on this system.
ru: Запрошенный продукт %s не активирован в этой системе.

source: The requested products '%s' are not activated on the system.
ru: Запрошенные продукты %s не активированы в этой системе.

source: There are no repositories marked for mirroring.
ru: Отсутствуют репозитории, помеченные для зеркального отображения.

source: URL
ru: URL-адрес

source: Unknown Registration Code.
ru: Неизвестный код регистрации.

source: Unknown hash function %{checksum_type}
ru: Неизвестная хэш-функция %{checksum_type}

source: Unmet product dependencies, activate one of these products first: %s
ru: Не соблюдены зависимости продукта, сначала активируйте один из следующих продуктов: %s

source: Updated system information for host '%s'
ru: Системная информация для сервера %s обновлена

source: Updating products
ru: Выполняется обновление продуктов

source: Updating repositories
ru: Выполняется обновление репозиториев

source: Updating subscriptions
ru: Выполняется обновление подписок

source: Version
ru: Версия

source: importing data from SMT.
ru: выполняется импорт данных из SMT.

source: repository by URL %{url} does not exist in database
ru: репозиторий с URL-адресом %{url} не существует в базе данных

source: × File does not exist or has wrong filesize, deduplication ignored %{error}.
ru: × Файл не существует или имеет неправильный размер, операция дедупликации будет пропущена, ошибка: %{error}.
